Revit 2024 API
RebarShapeDefinitionBySegments Constructor
 Create a rebar shape definition with a given number of segments.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public RebarShapeDefinitionBySegments(
	Document doc,
	int numberOfSegments
)
Visual Basic
Public Sub New ( _
	doc As Document, _
	numberOfSegments As Integer _
)
Visual C++
public:
RebarShapeDefinitionBySegments(
	Document^ doc,
	int numberOfSegments
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
 A document. The definition object is not a part of the document, but it will contain references to parameters that are in a document. The definition can be used for RebarShape creation only in the specified document.
numberOfSegments
Type: System.Int32
 The number of segments in the definition.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  numberOfSegments must be at least 1.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RebarShapeDefinitionBySegments Class
Autodesk.Revit.DB.Structure Namespace